{
  "basics": {
    "name": "Samuel Bunga",
    "label": "Bioinformatics Software Developer",
    "picture": "/images/sam.jpg",
    "email": "sambunga094@gmail.com",
    "phone": "857-701-9190",
    "website": "https://samuelbunga.github.io",
    "summary": "Hi! I'm a Bioinformatics Software Developer at Harvard Medical School. I am working on supporting the DARPA Panacea project which aims in developing new therapeutic drugs to block pain and inflammation using novel pharmacological platforms. My primary responsibilities are to develop and maintain existing RNA-Seq bulk/single-cell pipelines and also to develop new modules and integrate them into the pipelines using INDRA modeling systems developed at the Laboratory of Systems Pharmacology (LSP).",
    "location": {
      "address": "",
      "postalCode": "92122",
      "city": "San Diego",
      "countryCode": "USA",
      "region": "California"
    },
    "profiles": [
      {
        "network": "github",
        "username": "samuelbunga",
        "url": "http://github.com/samuelbunga"
      },
      {
        "network": "linkedin",
        "username": "samuelbunga",
        "url": "http://linkedin.com/in/samuelbunga"
      },
      {
        "network": "instagram",
        "username": "thebluenerve",
        "url": "http://instagram.com/thebluenerve"
      }
    ]
  },
  "interests": [
    {
      "name": "Single Cell Genomics",
      "keywords": [
      ]
    },
    {
      "name": "Network inference",
      "keywords": [
      ]
    },
    {
      "name": "Bioinformatics software development",
      "keywords": [
      ]
    }
  ],
  "skills": [
    {
      "name": "Programming/Development",
      "level": "",
      "keywords": [
        "Python", "JavaScript", "R", "Shell Scripting", "Nextflow", "PHP", "CI/CD", "Git", "AWS"
      ]
    },
    
  ],
  "education": [
    {
      "institution": "Northeastern University, Boston, MA",
      "area": "Bioinformatics",
      "studyType": "M.S.",
      "startDate": "August 2018",
      "endDate": "May 2020",
      "gpa": "3.73",
      "courses": [
        ""
      ]
    },
  ],
  "work": [
    {
      "company": "",
      "position": "Bioinformatics Scientist 2",
      "startDate": "February 2022",
      "endDate": "Present",
      "summary": "Illumina, Inc., San Diego, CA",
      "highlights": [
        "Developed bioinformatics infectious disease applications for the MiSeq i100 instrument",
        "Possess extensive experience in designing, developing, and optimizing Nextflow pipelines for high-throughput analysis workflows",
        "Contributed to the development of multiple bioinformatics applications, including DRAGEN Microbial Enrichment Plus, 16S Metagenomics, Microbiome Metagenomics/Metatranscriptomics, DRAGEN COVID Lineage, DRAGEN Viral Lineage etc.",
        "Designed reusable Nextflow and Python modules which are integrated across various DRAGEN pipelines, improving functionality and performance of internal tools"
      ]
    },
    {
      "company": "Harvard Program in Therapeutic Science (HiTS)",
      "position": "Bioinformatics Software Developer",
      "website": "",
      "startDate": "August 2020",
      "endDate": "February 2022",
      "summary": "Harvard Medical School, Boston, MA",
      "highlights": [
        "Developed Neuro-immune interactome pipeline using Nextflow and Python to study the interactions in different mouse pain models between Immune cell ligands and Neuron receptors using INDRA network and cellphonedb (github.com/indralab/panacea_indra)",
        "Designed a work-flow using COSMOS to integrate and connect data from different omic (Transcription factors and Kinases) datasets to make network level causal reasoning for Phospho Proteomics and Transcriptomics CFA and Naïve sciatic nerve samples",
        "Designed workflows for pre-processing in-Drops and 10X single-cell RNA-Seq raw samples using bcbio pipelines and cellranger respectively and used Seurat to work on the downstream analysis to integrate various mouse pain model samples and performed pseudo-bulk analysis to study the gene expression profiles from samples for each cluster",
        "Maintained and improved bulk and single-cell RNA-Seq pipelines for the Boston Children’s Hospital bioinformatics core",
        "Maintained code and made significant improvements to CXP-lite (Profiling neuronal activity from fluorescence imaging data) tool which potentially saved hours of work for researchers at Woolf lab (github.com/samuelbunga/cxp-lite)"
      ]
      
    }
    ,
    {
      "company": "Computational Methods-2",
      "position": "Graduate Teaching Assistant",
      "website": "",
      "startDate": "September 2019",
      "endDate": "April 2020",
      "summary": "Northeastern University, Boston, MA",
      "highlights": [
        "Led weekly lab sessions and office hours, supporting a cohort of 30 students in computational techniques and programming concepts",
        "Provide comprehensive academic support and mentored students on individual basis",
        "Designed, conducted, and evaluated quizzes and assignments",
        
      ]
    },
    {
      "company": "Bhasin Lab",
      "position": "Research Intern",
      "website": "",
      "startDate": "May 2019",
      "endDate": "December 2019",
      "summary": "Harvard Medical School, Boston, MA",
      "highlights": [
        "Designed and developed Single Cell Wizard, a free web application for processing 10X, CEL-Seq, and Drop-Seq single-cell RNA-Seq data.",
        "Developed home brew tools for Single Cell Wizard pipeline like FASTQ demultiplexer and FASTQ cleaner to remove singleton nucleotides and low-quality reads from each sample",
        "Assembled and created a Database for Gene expression markers that define cell types which can be used to annotate clusters of single cells via Gene Set Enrichment Analysis"
      ]
    },
  ],
  "volunteer": [
    {
      "organization": "",
      "website": "",
      "position": "",
      "startDate": "",
      "endDate": "",
      "summary": "1. Roos M, Bunga S, Tan A, Maissy E, Skola D, Richter A, Whittaker DS, Desplats P, Zarrinpar A, Conrad R, Kuersten S.2025.Optimizing mouse metatranscriptome profiling by selective removal of redundant nucleic acid sequences. mSystems10:e00167-25.https://doi.org/10.1128/msystems.00167-25",
      "highlights": [
        "",
      ]
    },
    {
      "organization": "",
      "website": "",
      "position": "",
      "startDate": "",
      "endDate": "",
      "summary": "2. Jain, A., Gyori, B.M., Hakim, S. et al. Nociceptor-immune interactomes reveal insult-specific immune signatures of pain. Nat Immunol 25, 1296–1305 (2024). https://doi.org/10.1038/s41590-024-01857-2",
      "highlights": [
        "",
      ]
    }
  ],
  
  "references": [
    {
      "name": "Available upon request",
      "reference": ""
    }
  ]
}
